// let urlData = [
// ]


let urlListData = [
  //沪深所有股票
  //"http://push2.eastmoney.com/api/qt/clist/get?pn=1&pz=4000&po=1&np=1&ut=b2884a393a59ad64002292a3e90d46a5&fltt=2&invt=2&fid0=f4001&fid=f62&fs=m:0+t:6+f:!2,m:0+t:13+f:!2,m:0+t:80+f:!2,m:1+t:2+f:!2,m:1+t:23+f:!2,m:0+t:7+f:!2,m:1+t:3+f:!2&stat=1&fields=f12,f14,f2,f3,f62,f184,f66,f69,f72,f75,f78,f81,f84,f87,f204,f205,f124&rt=53058491&cb=callback&_=1591754732878",

  //回归沪深300
  //"http://push2.eastmoney.com/api/qt/clist/get?pn=1&pz=300&po=1&np=1&ut=b2884a393a59ad64002292a3e90d46a5&fltt=2&invt=2&fid=f62&fs=b:BK0500&stat=1&fields=f12,f14,f2,f3,f62,f184,f66,f69,f72,f75,f78,f81,f84,f87,f204,f205,f124&rt=53081695&cb=callback&_=1592450870630",

  //按市值排序的所有股票
  "http://7.push2.eastmoney.com/api/qt/clist/get?cb=callback&pn=1&pz=4000&po=1&np=1&ut=bd1d9ddb04089700cf9c27f6f7426281&fltt=2&invt=2&fid=f21&fs=m:0+t:6,m:0+t:13,m:0+t:80,m:1+t:2,m:1+t:23&fields=f1,f2,f3,f4,f5,f6,f7,f8,f9,f10,f12,f13,f14,f15,f16,f17,f18,f20,f21,f23,f24,f25,f22,f11,f62,f128,f136,f115,f152&_=1592462107524",
]

//查询股价
let stockPriceQueryList = [



  "序号： 719 云南能投 (002053)  最新价: 7.25 涨幅：6.15% 主力: 198.62万 10日前：6.99 持股10日: 1.43% 本金最低价跌幅：-3% 单日最低价跌幅:-1.15% 连续收盘价跌幅：-0.57%",
  "序号： 141 信立泰 (002294)  最新价: 23.04 涨幅：6.27% 主力: 3058.37万 10日前：20.38 持股10日: 8.93% 本金最低价跌幅：-2.7% 单日最低价跌幅:-1.47% 连续收盘价跌幅：-2.27%",
  "序号： 650 ST创兴 (600193)  最新价: 4.41 涨幅：5% 主力: 265.39万 10日前：3.98 持股10日: 5.78% 本金最低价跌幅：-2.26% 单日最低价跌幅:-1.76% 连续收盘价跌幅：-1.77%",
  "序号： 689 常青股份 (603768)  最新价: 11.81 涨幅：2.16% 主力: 227.79万 10日前：11.17 持股10日: 5.37% 本金最低价跌幅：-3.13% 单日最低价跌幅:-1.88% 连续收盘价跌幅：-0.09%",
  "序号： 258 航天电器 (002025)  最新价: 28.56 涨幅：4.08% 主力: 1452.62万 10日前：28.05 持股10日: 1.5% 本金最低价跌幅：-4.1% 单日最低价跌幅:-1.97% 连续收盘价跌幅：-1.02%",
  "序号： 189 马应龙 (600993)  最新价: 18.62 涨幅：3.1% 主力: 2208.67万 10日前：17.42 持股10日: 5.91% 本金最低价跌幅：-4.25% 单日最低价跌幅:-2.09% 连续收盘价跌幅：-3.96%",
  "序号： 291 润都股份 (002923)  最新价: 19.49 涨幅：5.69% 主力: 1256.7万 10日前：17.46 持股10日: 9.62% 本金最低价跌幅：-2.52% 单日最低价跌幅:-2.15% 连续收盘价跌幅：-0.86%",
  "序号： 132 德展健康 (000813)  最新价: 6.12 涨幅：5.7% 主力: 3383.58万 10日前：5.37 持股10日: 9.31% 本金最低价跌幅：-2.79% 单日最低价跌幅:-2.33% 连续收盘价跌幅：-1.97%",
  "序号： 190 海翔药业 (002099)  最新价: 7.64 涨幅：2.83% 主力: 2178.24万 10日前：6.88 持股10日: 9.3% 本金最低价跌幅：-1.89% 单日最低价跌幅:-2.36% 连续收盘价跌幅：-0.44%",
  "序号： 2332 深圳华强 (000062)  最新价: 13.5 涨幅：4.81% 主力: -198.08万 10日前：12.30 持股10日: 7.32% 本金最低价跌幅：-2.52% 单日最低价跌幅:-2.46% 连续收盘价跌幅：-0.08%",
  "序号： 2150 ST厦华 (600870)  最新价: 3.41 涨幅：4.92% 主力: -143.54万 10日前：3.00 持股10日: 9.33% 本金最低价跌幅：-1.33% 单日最低价跌幅:-2.48% 连续收盘价跌幅：-1.24%",
  "序号： 3898 海格通信 (002465)  最新价: 13.6 涨幅：1.57% 主力: -15567.81万 10日前：12.33 持股10日: 8.6% 本金最低价跌幅：-2.84% 单日最低价跌幅:-2.50% 连续收盘价跌幅：-0.96%",
  "序号： 173 齐心集团 (002301)  最新价: 17.03 涨幅：4.93% 主力: 2495.77万 10日前：16.05 持股10日: 5.86% 本金最低价跌幅：-4.67% 单日最低价跌幅:-2.60% 连续收盘价跌幅：-0.56%",
  "序号： 995 ST南化 (600301)  最新价: 7.05 涨幅：2.92% 主力: 63.06万 10日前：6.63 持股10日: 4.52% 本金最低价跌幅：-4.37% 单日最低价跌幅:-2.61% 连续收盘价跌幅：-1.82%",
  "序号： 924 北方股份 (600262)  最新价: 18.27 涨幅：3.81% 主力: 83.62万 10日前：16.74 持股10日: 7.47% 本金最低价跌幅：-0.9% 单日最低价跌幅:-2.64% 连续收盘价跌幅：-0.29%",
  "序号： 615 好太太 (603848)  最新价: 14.84 涨幅：2.7% 主力: 311.66万 10日前：14.10 持股10日: 4.33% 本金最低价跌幅：-3.55% 单日最低价跌幅:-2.91% 连续收盘价跌幅：-2.14%",
  "序号： 430 欧普照明 (603515)  最新价: 27.77 涨幅：4.12% 主力: 647.37万 10日前：25.93 持股10日: 6.21% 本金最低价跌幅：-2.74% 单日最低价跌幅:-2.96% 连续收盘价跌幅：-0.89%",
  "序号： 130 北汽蓝谷 (600733)  最新价: 6.65 涨幅：3.58% 主力: 3395.82万 10日前：6.02 持股10日: 7.48% 本金最低价跌幅：-3.16% 单日最低价跌幅:-2.96% 连续收盘价跌幅：-0.16%",
  "序号： 55 七一二 (603712)  最新价: 34.29 涨幅：7.83% 主力: 7672.4万 10日前：29.46 持股10日: 11.34% 本金最低价跌幅：-3.09% 单日最低价跌幅:-2.99% 连续收盘价跌幅：-0.50%",
  "序号： 257 东方雨虹 (002271)  最新价: 41.4 涨幅：1.55% 主力: 1462.62万 10日前：39.01 持股10日: 5.82% 本金最低价跌幅：-4.49% 单日最低价跌幅:-3.00% 连续收盘价跌幅：-1.46%",
  "序号： 517 沙河股份 (000014)  最新价: 9.59 涨幅：4.24% 主力: 440.53万 10日前：8.81 持股10日: 7.83% 本金最低价跌幅：-1.59% 单日最低价跌幅:-3.04% 连续收盘价跌幅：-1.81%",
  "序号： 1827 国检集团 (603060)  最新价: 26.7 涨幅：0.41% 主力: -70.42万 10日前：23.08 持股10日: 15.21% 本金最低价跌幅：-3.16% 单日最低价跌幅:-3.16% 连续收盘价跌幅：-2.60%",
  "序号： 342 *ST湘电 (600416)  最新价: 14.39 涨幅：5.04% 主力: 964.24万 10日前：12.36 持股10日: 12.38% 本金最低价跌幅：-4.53% 单日最低价跌幅:-3.19% 连续收盘价跌幅：-3.59%",
  "序号： 240 福莱特 (601865)  最新价: 15.7 涨幅：3.29% 主力: 1613.4万 10日前：13.43 持股10日: 16.01% 本金最低价跌幅：-3.57% 单日最低价跌幅:-3.31% 连续收盘价跌幅：-1.53%",
  "序号： 224 电魂网络 (603258)  最新价: 43.18 涨幅：1.15% 主力: 1709.98万 10日前：39.55 持股10日: 8.14% 本金最低价跌幅：-3.84% 单日最低价跌幅:-3.37% 连续收盘价跌幅：-2.38%",
  "序号： 9 三七互娱 (002555)  最新价: 40.22 涨幅：4.93% 主力: 21717.39万 10日前：35.09 持股10日: 12.94% 本金最低价跌幅：-6.87% 单日最低价跌幅:-3.68% 连续收盘价跌幅：-5.79%",
  "序号： 89 航天机电 (600151)  最新价: 5.25 涨幅：6.06% 主力: 4812.28万 10日前：4.87 持股10日: 4.31% 本金最低价跌幅：-1.64% 单日最低价跌幅:-3.78% 连续收盘价跌幅：-3.38%",
  "序号： 2918 延长化建 (600248)  最新价: 4.57 涨幅：1.78% 主力: -492.63万 10日前：3.92 持股10日: 16.33% 本金最低价跌幅：-0.77% 单日最低价跌幅:-3.79% 连续收盘价跌幅：-0.76%",
  "序号： 167 嘉欣丝绸 (002404)  最新价: 6.52 涨幅：3.16% 主力: 2619.27万 10日前：6.06 持股10日: 7.43% 本金最低价跌幅：-1.98% 单日最低价跌幅:-4.04% 连续收盘价跌幅：-1.45%",
  "序号： 3436 亚玛顿 (002623)  最新价: 43.21 涨幅：2.42% 主力: -1332.44万 10日前：38.79 持股10日: 8.77% 本金最低价跌幅：-7.19% 单日最低价跌幅:-4.20% 连续收盘价跌幅：-5.91%",
  "序号： 148 周大生 (002867)  最新价: 22.45 涨幅：6.35% 主力: 2941.73万 10日前：20.79 持股10日: 2.45% 本金最低价跌幅：-4.04% 单日最低价跌幅:-4.36% 连续收盘价跌幅：-0.15%",
  "序号： 3773 飞龙股份 (002536)  最新价: 6.92 涨幅：3.59% 主力: -4408.62万 10日前：6.10 持股10日: 9.51% 本金最低价跌幅：-4.92% 单日最低价跌幅:-4.47% 连续收盘价跌幅：-0.65%",
  "序号： 14 华鑫股份 (600621)  最新价: 19.42 涨幅：6.94% 主力: 19420.38万 10日前：17.51 持股10日: 10.91% 本金最低价跌幅：-4.34% 单日最低价跌幅:-4.51% 连续收盘价跌幅：-0.06%",
  "序号： 2511 和科达 (002816)  最新价: 32.57 涨幅：1.18% 主力: -254.6万 10日前：29.67 持股10日: 8.53% 本金最低价跌幅：-4.75% 单日最低价跌幅:-4.75% 连续收盘价跌幅：-0.16%",
  "序号： 352 亚士创能 (603378)  最新价: 45.81 涨幅：4.92% 主力: 907.15万 10日前：40.97 持股10日: 9.54% 本金最低价跌幅：-4.81% 单日最低价跌幅:-4.81% 连续收盘价跌幅：-0.81%",
  "序号： 975 *ST友谊 (000679)  最新价: 3.9 涨幅：4.56% 主力: 68.35万 10日前：3.32 持股10日: 15.06% 本金最低价跌幅：-0.6% 单日最低价跌幅:-4.92% 连续收盘价跌幅：-1.98%",
  "序号： 1115 ST长投 (600119)  最新价: 7.38 涨幅：3.22% 主力: 31.67万 10日前：5.86 持股10日: 22.7% 本金最低价跌幅：-0.51% 单日最低价跌幅:-4.93% 连续收盘价跌幅：-4.48%",
  "序号： 2194 伯特利 (603596)  最新价: 33.85 涨幅：4.48% 主力: -154.87万 10日前：29.41 持股10日: 12.89% 本金最低价跌幅：-2.82% 单日最低价跌幅:-5.00% 连续收盘价跌幅：-1.56%",
  "序号： 3385 润达医疗 (603108)  最新价: 13.45 涨幅：4.83% 主力: -1195.97万 10日前：12.15 持股10日: 10.29% 本金最低价跌幅：-2.47% 单日最低价跌幅:-5.26% 连续收盘价跌幅：-2.14%",
  "序号： 123 南极电商 (002127)  最新价: 20.15 涨幅：5.72% 主力: 3516.28万 10日前：19.65 持股10日: 2.14% 本金最低价跌幅：-7.63% 单日最低价跌幅:-5.55% 连续收盘价跌幅：-0.57%",
  "序号： 332 百利科技 (603959)  最新价: 8.76 涨幅：6.83% 主力: 1030.56万 10日前：7.18 持股10日: 17.13% 本金最低价跌幅：-5.15% 单日最低价跌幅:-5.66% 连续收盘价跌幅：-8.05%",
  "序号： 51 蓝帆医疗 (002382)  最新价: 28.28 涨幅：9.02% 主力: 8221.97万 10日前：24.50 持股10日: 10.2% 本金最低价跌幅：-5.88% 单日最低价跌幅:-5.88% 连续收盘价跌幅：-0.82%",
  "序号： 3864 朗姿股份 (002612)  最新价: 12.88 涨幅：5.57% 主力: -9734.72万 10日前：7.87 持股10日: 55.02% 本金最低价跌幅：-3.05% 单日最低价跌幅:-7.46% 连续收盘价跌幅：0%",
  "序号： 230 众信旅游 (002707)  最新价: 7.22 涨幅：4.79% 主力: 1659.28万 10日前：6.82 持股10日: 5.57% 本金最低价跌幅：-13.78% 单日最低价跌幅:-9.97% 连续收盘价跌幅：-1.38%",
  "序号： 3649 海德股份 (000567)  最新价: 16.45 涨幅：6.89% 主力: -2470.53万 10日前：12.58 持股10日: 23.13% 本金最低价跌幅：-1.75% 单日最低价跌幅:-10.01% 连续收盘价跌幅：-1.43%"  


]





